Catalogs/CounterpartyContracts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>CounterpartyContracts</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Counterparties</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SettlementsCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContractDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SettlementsInStandardUnits</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContractNo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CustomerPaymentDueDate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VendorPaymentDueDate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContractKind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ContractKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PriceKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyPriceKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartyPriceKind</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountMarkupKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.MarkupAndDiscountKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContractForm</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ContractForms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>EditableParameters</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>FormRefs</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContractForms</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>InfobaseParameters</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>FormRefs</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContractForms</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Parameter</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
								<v8:Type>cfg:EnumRef.ContractsWithCounterpartiesTemplatesParameters</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ContractKinds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ContractKinds</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>WithVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WithCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromPrincipal</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WithAgent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/OperationKindsCustomerInvoice.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>OperationKindsCustomerInvoice</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>SaleToCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TransferForCommission</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TransferToProcessing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TransferForSafeCustody</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnToVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnToPrincipal</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnFromProcessing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnFromSafeCustody</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/OperationKindsSupplierInvoice.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>OperationKindsSupplierInvoice</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ReceiptFromVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReceptionForCommission</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReceptionIntoProcessing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReceptionForSafeCustody</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnFromCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnFromAgent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnFromSubcontractor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnFromSafeCustody</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/OperationKindsNetting.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>OperationKindsNetting</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Netting</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CustomerDebtAssignment</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DebtAssignmentToVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CustomerDebtAdjustment</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VendorDebtAdjustment</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/OperationKindsCustomerOrder.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>OperationKindsCustomerOrder</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>OrderForSale</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OrderForProcessing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JobOrder</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/OperationKindsPurchaseOrder.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>OperationKindsPurchaseOrder</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>OrderForPurchase</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OrderForProcessing</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/OperationKindsCashReceipt.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>OperationKindsCashReceipt</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FromCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromAdvanceHolder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RetailIncome</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RetailIncomeAccrualAccounting</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CurrencyPurchase</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/OperationKindsPaymentReceipt.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>OperationKindsPaymentReceipt</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FromCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromAdvanceHolder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CurrencyPurchase</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Taxes</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/OperationKindsCashPayment.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>OperationKindsCashPayment</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Salary</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SalaryForEmployee</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Taxes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToAdvanceHolder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TransferToCashCR</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/CounterpartyContracts/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

// Function returns the list of the "key" attributes names.
//
Function GetObjectAttributesBeingLocked() Export
	
	Result = New Array;
	Result.Add("Owner");
	Result.Add("SettlementsCurrency");
	
	Return Result;
	
EndFunction // GetLockedObjectAttributes()

// Receives the counterparty contract by default according to the filter conditions. Default or the only contract returns or an empty reference.
//
// Parameters
//  Counterparty	-	<CatalogRef.Counterparty> 
// 						counterparty, contract of which
//  is	needed	to 
// 						get Company - <CatalogRef.Companies> Company,
//  contract	of	which is needed to get ContractKindsList - <Array> 
// 						or <ValuesList> consisting values of the type <EnumRef.ContractKinds> Desired contract kinds
//
// Returns:
//   <CatalogRef.CounterpartyContracts> - found contract or empty ref
//
Function GetDefaultContractByCompanyContractKind(Counterparty, Company, ContractKindsList = Undefined) Export
	
	CounterpartyMainContract = Counterparty.ContractByDefault;
	
	If Not SmallBusinessReUse.CounterpartyContractsControlNeeded() Then
		
		Return CounterpartyMainContract;
	EndIf;
	
	If ContractKindsList = Undefined
		OR (ContractKindsList.FindByValue(CounterpartyMainContract.ContractKind) <> Undefined
		AND CounterpartyMainContract.Company = Company) Then
		
		Return CounterpartyMainContract;
	EndIf;
	
	Query = New Query;
	QueryText = 
	"SELECT ALLOWED
	|	CounterpartyContracts.Ref
	|FROM
	|	Catalog.CounterpartyContracts AS CounterpartyContracts
	|WHERE
	|	CounterpartyContracts.Owner = &Counterparty
	|	AND CounterpartyContracts.Company = &Company
	|	AND CounterpartyContracts.DeletionMark = False"
	+?(ContractKindsList <> Undefined,"
	|	And CounterpartyContracts.ContractType IN (&ContractTypeList)","");
	
	Query.SetParameter("Counterparty", Counterparty);
	Query.SetParameter("Company", Company);
	Query.SetParameter("ContractKindsList", ContractKindsList);
	
	Query.Text = QueryText;
	Result = Query.Execute();
	
	If Result.IsEmpty() Then
		Return Catalogs.CounterpartyContracts.EmptyRef();
	EndIf;
	
	Selection = Result.Select();
	
	Selection.Next();
	Return Selection.Ref;

EndFunction // GetContractOfCounterparty()

// Checks the counterparty contract on the map to passed parameters.
//
// Parameters
// MessageText - <String> - error message
// about	errors	Contract - <CatalogRef.CounterpartyContracts> - checked
// contract	Company	- <CatalogRef.Company> - company
// document	Counterparty	- <CatalogRef.Counterparty> - document
// counterparty	ContractKindsList	- <ValuesList> consisting values of the type <EnumRef.ContractKinds>. 
// 						Desired contract kinds.
//
// Returns:
// <Boolean> -True if checking is completed successfully.
//
Function ContractMeetsDocumentTerms(MessageText, Contract, Company, Counterparty, ContractKindsList) Export
	
	MessageText = "";
	
	If Not Counterparty.DoOperationsByContracts Then
		Return True;
	EndIf;
	
	DoesNotMatchCompany = False;
	DoesNotMatchContractKind = False;
	
	If Contract.Company <> Company Then
		DoesNotMatchCompany = True;
	EndIf;
		
	If ContractKindsList.FindByValue(Contract.ContractKind) = Undefined Then
		DoesNotMatchContractKind = True;
	EndIf;
	
	If (DoesNotMatchCompany OR DoesNotMatchContractKind) = False Then
		Return True;
	EndIf;
	
	MessageText = NStr("en = 'Contract attributes do not match the document terms:'");
	
	If DoesNotMatchCompany Then
		MessageText = MessageText + NStr("en = '
		| - The company does not match'");
	EndIf;
	
	If DoesNotMatchContractKind Then
		MessageText = MessageText + NStr("en = '
		| - Contract kind does not match'");
	EndIf;
	
	Return False;
	
EndFunction // ContractMeetsDocumentTerms()

// Returns a list of available contract kinds for the document.
//
// Parameters
// Document  - any document providing counterparty
// contract OperationKind  - document operation kind.
//
// Returns:
// <ValuesList>   - list of contract kinds which are available for the document.
//
Function GetContractKindsListForDocument(Document, OperationKind = Undefined, TabularSectionName = "") Export
	
	ContractKindsList = New ValueList;
	
	If TypeOf(Document) = Type("DocumentRef.AcceptanceCertificate") Then
		
		ContractKindsList.Add(Enums.ContractKinds.WithCustomer);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.EnterOpeningBalance") Then
		
		If TabularSectionName = "InventoryTransferred" Then
			
			If OperationKind = Enums.OperationKindsCustomerInvoice.TransferForCommission Then
				ContractKindsList.Add(Enums.ContractKinds.WithAgent);
			Else
				ContractKindsList.Add(Enums.ContractKinds.WithVendor);
			EndIf;
			
		ElsIf TabularSectionName = "InventoryReceived" Then
			
			If OperationKind = Enums.OperationKindsSupplierInvoice.ReceptionForCommission Then
				ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
			Else
				ContractKindsList.Add(Enums.ContractKinds.WithCustomer);
			EndIf;
			
		ElsIf TabularSectionName = "AccountsPayable" Then
			
			ContractKindsList.Add(Enums.ContractKinds.WithVendor);
			ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
			
		ElsIf TabularSectionName = "AccountsReceivable" Then
			
			ContractKindsList.Add(Enums.ContractKinds.WithCustomer);
			ContractKindsList.Add(Enums.ContractKinds.WithAgent);
			
		EndIf;
		
	ElsIf TypeOf(Document) = Type("DocumentRef.Netting") Then
		
		If TabularSectionName = "Debitor" Then
			ContractKindsList.Add(Enums.ContractKinds.WithCustomer);
			ContractKindsList.Add(Enums.ContractKinds.WithAgent);
		ElsIf TabularSectionName = "Creditor" Then
			ContractKindsList.Add(Enums.ContractKinds.WithVendor);
			ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
		Else
			If OperationKind = Enums.OperationKindsNetting.CustomerDebtAssignment Then
				ContractKindsList.Add(Enums.ContractKinds.WithCustomer);
				ContractKindsList.Add(Enums.ContractKinds.WithAgent);
			Else
				ContractKindsList.Add(Enums.ContractKinds.WithVendor);
				ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
			EndIf;
		EndIf;
		
	ElsIf TypeOf(Document) = Type("DocumentRef.PowerOfAttorney") Then
		
		ContractKindsList.Add(Enums.ContractKinds.WithVendor);
		ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.AdditionalCosts") Then
		
		ContractKindsList.Add(Enums.ContractKinds.WithVendor);
		ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.CustomerOrder") Then
		
		If OperationKind = Enums.OperationKindsCustomerOrder.OrderForSale Then
			ContractKindsList.Add(Enums.ContractKinds.WithCustomer);
			ContractKindsList.Add(Enums.ContractKinds.WithAgent);
		Else
			ContractKindsList.Add(Enums.ContractKinds.WithCustomer);
		EndIf;
		
	ElsIf TypeOf(Document) = Type("DocumentRef.PurchaseOrder") Then
		
		If OperationKind = Enums.OperationKindsPurchaseOrder.OrderForPurchase Then
			ContractKindsList.Add(Enums.ContractKinds.WithVendor);
			ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
		Else
			ContractKindsList.Add(Enums.ContractKinds.WithVendor);
		EndIf;
		
	ElsIf TypeOf(Document) = Type("DocumentRef.AgentReport") Then
		
		ContractKindsList.Add(Enums.ContractKinds.WithAgent);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.ReportToPrincipal") Then
		
		ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.ProcessingReport") Then
		
		ContractKindsList.Add(Enums.ContractKinds.WithCustomer);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.SubcontractorReport") Then
		
		ContractKindsList.Add(Enums.ContractKinds.WithVendor);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.CashReceipt") 
		OR TypeOf(Document) = Type("DocumentRef.PaymentReceipt") Then
		
		If OperationKind = Enums.OperationKindsCashReceipt.FromVendor
			OR OperationKind = Enums.OperationKindsPaymentReceipt.FromVendor Then
			ContractKindsList.Add(Enums.ContractKinds.WithVendor);
			ContractKindsList.Add(Enums.ContractKinds.WithAgent);
			ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
		Else
			ContractKindsList.Add(Enums.ContractKinds.WithCustomer);
			ContractKindsList.Add(Enums.ContractKinds.WithAgent);
			ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
		EndIf;
		
	ElsIf TypeOf(Document) = Type("DocumentRef.SupplierInvoice") Then
		
		If OperationKind = Enums.OperationKindsSupplierInvoice.ReceptionForCommission Then
			ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
		ElsIf OperationKind = Enums.OperationKindsSupplierInvoice.ReturnFromAgent Then
			ContractKindsList.Add(Enums.ContractKinds.WithAgent);
		ElsIf OperationKind = Enums.OperationKindsSupplierInvoice.ReceptionIntoProcessing
			OR OperationKind = Enums.OperationKindsSupplierInvoice.ReceptionForSafeCustody
			OR OperationKind = Enums.OperationKindsSupplierInvoice.ReturnFromCustomer Then
			ContractKindsList.Add(Enums.ContractKinds.WithCustomer);
		Else 
			ContractKindsList.Add(Enums.ContractKinds.WithVendor);
		EndIf;
		
	ElsIf TypeOf(Document) = Type("DocumentRef.CashPayment") 
		OR TypeOf(Document) = Type("DocumentRef.PaymentExpense") Then
		
		If OperationKind = Enums.OperationKindsCashPayment.Vendor 
			OR OperationKind = Enums.OperationKindsPaymentExpense.Vendor Then
			ContractKindsList.Add(Enums.ContractKinds.WithVendor);
			ContractKindsList.Add(Enums.ContractKinds.WithAgent);
			ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
		Else
			ContractKindsList.Add(Enums.ContractKinds.WithCustomer);
			ContractKindsList.Add(Enums.ContractKinds.WithAgent);
			ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
		EndIf;
		
	ElsIf TypeOf(Document) = Type("DocumentRef.CustomerInvoice") Then
		
		If OperationKind = Enums.OperationKindsCustomerInvoice.TransferForCommission Then
			ContractKindsList.Add(Enums.ContractKinds.WithAgent);
		ElsIf OperationKind = Enums.OperationKindsCustomerInvoice.ReturnToPrincipal Then
			ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
		ElsIf OperationKind = Enums.OperationKindsCustomerInvoice.TransferToProcessing
			OR OperationKind = Enums.OperationKindsCustomerInvoice.TransferForSafeCustody
			OR OperationKind = Enums.OperationKindsCustomerInvoice.ReturnToVendor Then
			ContractKindsList.Add(Enums.ContractKinds.WithVendor);
		Else 
			ContractKindsList.Add(Enums.ContractKinds.WithCustomer);
		EndIf;
		
	ElsIf TypeOf(Document) = Type("DocumentRef.InvoiceForPayment") Then
		
		ContractKindsList.Add(Enums.ContractKinds.WithCustomer);
		ContractKindsList.Add(Enums.ContractKinds.WithAgent);
		ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.SupplierInvoiceForPayment") Then
		
		ContractKindsList.Add(Enums.ContractKinds.WithVendor);
		ContractKindsList.Add(Enums.ContractKinds.WithAgent);
		ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
		
	ElsIf TypeOf(Document) = Type("DocumentRef.CustomerInvoiceNote") Then
		
		If OperationKind = Enums.OperationKindsCustomerInvoiceNote.OnPrincipalAdvance Then
			ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
		Else
			ContractKindsList.Add(Enums.ContractKinds.WithCustomer);
			ContractKindsList.Add(Enums.ContractKinds.WithVendor);
			ContractKindsList.Add(Enums.ContractKinds.WithAgent);
			ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
		EndIf;
		
	ElsIf TypeOf(Document) = Type("DocumentRef.SupplierInvoiceNote") Then
		
		ContractKindsList.Add(Enums.ContractKinds.WithCustomer);
		ContractKindsList.Add(Enums.ContractKinds.WithVendor);
		ContractKindsList.Add(Enums.ContractKinds.WithAgent);
		ContractKindsList.Add(Enums.ContractKinds.FromPrincipal);
		
	EndIf;
	
	Return ContractKindsList;
	
EndFunction // GetContractKindsListForDocument()

#Region PrintInterface

// Fills in Customer order printing commands list
// 
// Parameters:
//   PrintCommands - ValueTable - see fields' content in the PrintManagement.CreatePrintCommandsCollection function.
//
Procedure AddPrintCommands(PrintCommands) Export
	
	// Contract
	PrintCommand = PrintCommands.Add();
	PrintCommand.Handler = "SmallBusinessClient.PrintCounterpartyContract";
	PrintCommand.ID = "ContractForm";
	PrintCommand.Presentation = NStr("en = 'Contract form'");
	PrintCommand.FormsList = "ItemForm,ListForm,ChoiceForm,ChoiceFormWithCounterparty";
	PrintCommand.Order = 1;
	
EndProcedure

#EndRegion

#EndIf
